Config/Documents/МенюТребование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>МенюТребование</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасходПродуктов</xr:Item>
				<xr:Item>AccumulationRegister.РезервМЗ</xr:Item>
				<xr:Item>InformationRegister.РасшифровкаКУДиР</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
				<xr:Item>AccumulationRegister.КнигаУчетаДоходовИРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Повар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кладовщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеМенюТребование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавитьКОсновномуКонтингенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МенюТребование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резервировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аннулирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КатегорииДовольствующихся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияДовольствующихся</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииДовольствующихся</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантМеню</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыМеню</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокМеню</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МенюРаскладка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияДовольствующихся</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииДовольствующихся</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантМеню</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыМеню</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриемПищи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриемыПищи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставБлюда</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КатегорияДовольствующихся</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииДовольствующихся</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантМеню</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыМеню</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриемПищи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПриемыПищи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияДовольствующихся</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КатегорииДовольствующихся</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/AccumulationRegisters/РасходПродуктов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасходПродуктов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КоличествоДовольствующихся</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавитьКОсновномуКонтингенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияДовольствующихся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииДовольствующихся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/InformationRegisters/ЧисленностьДовольствующихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЧисленностьДовольствующихся</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияДовольствующихся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииДовольствующихся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ТиповыеМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТиповыеМеню</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выход</Name>
					<Comment>Выход блюда в граммах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХронологическийПорядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВариантМеню</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыМеню</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриемПищи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриемыПищи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Блюдо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпецификацииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/МенюТребование/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ОтразитьДвиженияРезервирования(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УдалитьЛишниеПродуктыПоКатегориям();
	
	Счет10532 = БухгалтерскийУчет.СчетПоКоду("105.32", Дата, Организация);
	СвойстваСчета10532 = БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(Счет10532);
	ОбязательноУказыватьПодразделение = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") 
		И (СвойстваСчета10532.УчетПоПодразделениям И НЕ СвойстваСчета10532.РазрешитьНеУказыватьПодразделение);
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям") И НЕ ОбязательноУказыватьПодразделение Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Подразделение");
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	// Проверка корректности указания количества списанных (возвращенных) материалов.
	Для Каждого СтрокаМатериалы Из Материалы Цикл
		
		Если ЭтоВозврат И СтрокаМатериалы.Количество > 0 Тогда
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
				НСтр("ru = 'Количество'"),
				СтрокаМатериалы.НомерСтроки,
				НСтр("ru = 'Продукты'"),
				НСтр("ru='При возврате количество продуктов должно быть указано с минусом.'"));
				
			ПолеКоличество = "Материалы[" + Формат(СтрокаМатериалы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].Количество";
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПолеКоличество, "Объект", Отказ);
			
		ИначеЕсли НЕ ЭтоВозврат И СтрокаМатериалы.Количество < 0 Тогда
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка", "Корректность",
				НСтр("ru = 'Количество'"),
				СтрокаМатериалы.НомерСтроки,
				НСтр("ru = 'Продукты'"),
				НСтр("ru='Указано отрицательное количество продуктов.'"));
				
			ПолеКоличество = "Материалы[" + Формат(СтрокаМатериалы.НомерСтроки - 1, "ЧН=0; ЧГ=") + "].Количество";
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, ПолеКоличество, "Объект", Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
	// Проверка корректности заполнения источников средств в категориях довольствующихся.
	Документы.МенюТребование.ПроверитьЗаполнениеСчетаЗатрат(
		Материалы.Выгрузить(,"КатегорияДовольствующихся,ИФО,КФО"), Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьЛишниеПродуктыПоКатегориям();
	УправлениеМатериальнымиЗапасами.ДокументПередЗаписью(ЭтотОбъект, РежимЗаписи, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.МенюТребование") Тогда
		ДокументОснование = ДанныеЗаполнения;
		ЗаполняемыеДанные = "Организация, Подразделение, ЦМО, Комментарий, Бухгалтер, Врач, Повар, Кладовщик, ЭтоВозврат";
		ДанныеДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗаполняемыеДанные);
		Если Не ДанныеДокументаОснования.ЭтоВозврат Тогда 
			
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеДокументаОснования);
			
			ТекстЗапроса ="ВЫБРАТЬ
			|	МенюТребованиеКатегорииДовольствующихся.Ссылка КАК Ссылка,
			|	МенюТребованиеКатегорииДовольствующихся.НомерСтроки КАК НомерСтроки,
			|	МенюТребованиеКатегорииДовольствующихся.КатегорияДовольствующихся КАК КатегорияДовольствующихся,
			|	МенюТребованиеКатегорииДовольствующихся.Количество КАК Количество,
			|	МенюТребованиеКатегорииДовольствующихся.ВариантМеню КАК ВариантМеню,
			|	МенюТребованиеКатегорииДовольствующихся.ПорядокМеню КАК ПорядокМеню
			|ИЗ
			|	Документ.МенюТребование.КатегорииДовольствующихся КАК МенюТребованиеКатегорииДовольствующихся
			|ГДЕ
			|	МенюТребованиеКатегорииДовольствующихся.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	МенюТребованиеМатериалы.Ссылка КАК Ссылка,
			|	МенюТребованиеМатериалы.НомерСтроки КАК НомерСтроки,
			|	МенюТребованиеМатериалы.КФО КАК КФО,
			|	МенюТребованиеМатериалы.КПС КАК КПС,
			|	МенюТребованиеМатериалы.Номенклатура КАК Номенклатура,
			|	МенюТребованиеМатериалы.СчетУчета КАК СчетУчета,
			|	МенюТребованиеМатериалы.КатегорияДовольствующихся КАК КатегорияДовольствующихся,
			|	МенюТребованиеМатериалы.ИФО КАК ИФО,
			|	-МенюТребованиеМатериалы.Количество КАК Количество,
			|	ВЫБОР
			|		КОГДА РасходПродуктов.Количество = 0
			|				ИЛИ РасходПродуктов.Количество ЕСТЬ NULL
			|			ТОГДА 0
			|		ИНАЧЕ РасходПродуктов.Сумма / РасходПродуктов.Количество
			|	КОНЕЦ КАК Цена,
			|	-РасходПродуктов.Сумма КАК Сумма
			|ИЗ
			|	Документ.МенюТребование.Материалы КАК МенюТребованиеМатериалы
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасходПродуктов КАК РасходПродуктов
			|		ПО МенюТребованиеМатериалы.КФО = РасходПродуктов.КФО
			|			И МенюТребованиеМатериалы.ИФО = РасходПродуктов.ИФО
			|			И МенюТребованиеМатериалы.Номенклатура = РасходПродуктов.Номенклатура
			|			И МенюТребованиеМатериалы.КатегорияДовольствующихся = РасходПродуктов.КатегорияДовольствующихся
			|			И МенюТребованиеМатериалы.Ссылка = РасходПродуктов.Регистратор
			|			И МенюТребованиеМатериалы.НомерСтроки = РасходПродуктов.НомерСтроки
			|ГДЕ
			|	МенюТребованиеМатериалы.Ссылка = &Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки" ;
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Ссылка",ДанныеЗаполнения);
			Выборка = Запрос.ВыполнитьПакет();
			ТаблицаКатегорииДовольствующихся = Выборка[0].Выгрузить();
			ТаблицаМатериалы = Выборка[1].Выгрузить();
			КатегорииДовольствующихся.Загрузить(ТаблицаКатегорииДовольствующихся);
			Материалы.Загрузить(ТаблицаМатериалы);
			
			ЭтоВозврат = Истина;
		Иначе
			ВызватьИсключение "Ввод на основании документа с видом ""Возврат продуктов"" невозможен!";	
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Аннулирован = Ложь;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДокумента

Процедура ЗаполнитьДокумент(СтруктураТЧ = Неопределено) Экспорт
	Перем ТекущаяКатегория;
	Перем ТекущееБлюдо;
	
	Если СтруктураТЧ = Неопределено Тогда
		СтруктураТЧ = Новый Структура("КатегорииДовольствующихся, МенюРаскладка, СоставБлюда, Материалы");
	КонецЕсли;
	
	Если СтруктураТЧ.Свойство("КатегорииДовольствующихся") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КатегорииДовольствующихся.Ссылка КАК КатегорияДовольствующихся,
		               |	КатегорииДовольствующихся.ВариантМеню,
		               |	ЕСТЬNULL(ЧисленностьДовольствующихсяСрезПоследних.Количество, 0) КАК Количество,
		               |	КатегорииДовольствующихся.Код КАК КатегорияДовольствующихсяКод,
		               |	КатегорииДовольствующихся.ВариантМеню.Код
		               |ПОМЕСТИТЬ ИспользуемыеКатегории
		               |ИЗ
		               |	Справочник.КатегорииДовольствующихся КАК КатегорииДовольствующихся
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЧисленностьДовольствующихся.СрезПоследних(&Период, Организация = &Организация) КАК ЧисленностьДовольствующихсяСрезПоследних
		               |		ПО КатегорииДовольствующихся.Ссылка = ЧисленностьДовольствующихсяСрезПоследних.КатегорияДовольствующихся
		               |ГДЕ
		               |	ЕСТЬNULL(ЧисленностьДовольствующихсяСрезПоследних.Количество, 0) <> 0
		               |	И КатегорииДовольствующихся.Владелец = &Организация
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МенюТребованиеКатегорииДовольствующихся.Ссылка.Дата,
		               |	МенюТребованиеКатегорииДовольствующихся.КатегорияДовольствующихся,
		               |	МенюТребованиеКатегорииДовольствующихся.ВариантМеню,
		               |	МенюТребованиеКатегорииДовольствующихся.ПорядокМеню
		               |ПОМЕСТИТЬ ПредыдущиеДокументы
		               |ИЗ
		               |	Документ.МенюТребование.КатегорииДовольствующихся КАК МенюТребованиеКатегорииДовольствующихся
		               |ГДЕ
		               |	МенюТребованиеКатегорииДовольствующихся.Ссылка.Дата < &Период
		               |	И МенюТребованиеКатегорииДовольствующихся.Ссылка <> &Ссылка
		               |	И НЕ МенюТребованиеКатегорииДовольствующихся.Ссылка.ПометкаУдаления
		               |	И МенюТребованиеКатегорииДовольствующихся.Ссылка.Организация = &Организация
		               |	И МенюТребованиеКатегорииДовольствующихся.КатегорияДовольствующихся В
		               |			(ВЫБРАТЬ
		               |				ИспользуемыеКатегории.КатегорияДовольствующихся
		               |			ИЗ
		               |				ИспользуемыеКатегории)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПредыдущиеДокументы.КатегорияДовольствующихся,
		               |	ПредыдущиеДокументы.ВариантМеню,
		               |	МАКСИМУМ(ПредыдущиеДокументы.Дата) КАК Дата
		               |ПОМЕСТИТЬ ПредыдущиеДаты
		               |ИЗ
		               |	ПредыдущиеДокументы КАК ПредыдущиеДокументы
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПредыдущиеДокументы.КатегорияДовольствующихся,
		               |	ПредыдущиеДокументы.ВариантМеню
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТиповыеМеню.ВариантМеню,
		               |	МАКСИМУМ(ТиповыеМеню.Порядок) КАК Порядок
		               |ПОМЕСТИТЬ КоличествоВариантов
		               |ИЗ
		               |	РегистрСведений.ТиповыеМеню КАК ТиповыеМеню
		               |ГДЕ
		               |	ТиповыеМеню.ВариантМеню В
		               |			(ВЫБРАТЬ
		               |				ИспользуемыеКатегории.ВариантМеню
		               |			ИЗ
		               |				ИспользуемыеКатегории)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТиповыеМеню.ВариантМеню
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ИспользуемыеКатегории.КатегорияДовольствующихся,
		               |	ИспользуемыеКатегории.ВариантМеню,
		               |	ИспользуемыеКатегории.Количество,
		               |	ИспользуемыеКатегории.КатегорияДовольствующихсяКод,
		               |	ИспользуемыеКатегории.ВариантМенюКод,
		               |	ВЫБОР
		               |		КОГДА ЕСТЬNULL(ПредыдущиеДокументы.ПорядокМеню, 0) + 1 > ЕСТЬNULL(КоличествоВариантов.Порядок, 0)
		               |			ТОГДА 1
		               |		ИНАЧЕ ЕСТЬNULL(ПредыдущиеДокументы.ПорядокМеню, 0) + 1
		               |	КОНЕЦ КАК ПорядокМеню
		               |ИЗ
		               |	ИспользуемыеКатегории КАК ИспользуемыеКатегории
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ПредыдущиеДаты КАК ПредыдущиеДаты
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ПредыдущиеДокументы КАК ПредыдущиеДокументы
		               |			ПО ПредыдущиеДаты.КатегорияДовольствующихся = ПредыдущиеДокументы.КатегорияДовольствующихся
		               |				И ПредыдущиеДаты.ВариантМеню = ПредыдущиеДокументы.ВариантМеню
		               |				И ПредыдущиеДаты.Дата = ПредыдущиеДокументы.Дата
		               |		ПО ИспользуемыеКатегории.КатегорияДовольствующихся = ПредыдущиеДаты.КатегорияДовольствующихся
		               |			И ИспользуемыеКатегории.ВариантМеню = ПредыдущиеДаты.ВариантМеню
		               |		ЛЕВОЕ СОЕДИНЕНИЕ КоличествоВариантов КАК КоличествоВариантов
		               |		ПО ИспользуемыеКатегории.ВариантМеню = КоличествоВариантов.ВариантМеню";
		Запрос.УстановитьПараметр("Период", 		Дата);
		Запрос.УстановитьПараметр("Организация",	Организация);
		Запрос.УстановитьПараметр("Ссылка",			Ссылка);
		
		КатегорииДовольствующихся.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕсли;
	
	Если СтруктураТЧ.Свойство("МенюРаскладка") Тогда
		
		Если СтруктураТЧ.Свойство("ТекущаяКатегория", ТекущаяКатегория) Тогда
			ТаблицаКатегорий = Новый ТаблицаЗначений;
			ТаблицаКатегорий.Колонки.Добавить("КатегорияДовольствующихся", Новый ОписаниеТипов("СправочникСсылка.КатегорииДовольствующихся"));
			ТаблицаКатегорий.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
			ТаблицаКатегорий.Колонки.Добавить("ВариантМеню", Новый ОписаниеТипов("СправочникСсылка.ВариантыМеню"));
			ТаблицаКатегорий.Колонки.Добавить("ПорядокМеню", Новый ОписаниеТипов("Число"));
			
			ЗаполнитьЗначенияСвойств(ТаблицаКатегорий.Добавить(), ТекущаяКатегория);
		Иначе
			ТаблицаКатегорий = КатегорииДовольствующихся.Выгрузить();
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫРАЗИТЬ(ТаблицаКатегорий.КатегорияДовольствующихся КАК Справочник.КатегорииДовольствующихся) КАК КатегорияДовольствующихся,
		               |	ТаблицаКатегорий.Количество КАК Количество,
		               |	ВЫРАЗИТЬ(ТаблицаКатегорий.ВариантМеню КАК Справочник.ВариантыМеню) КАК ВариантМеню,
		               |	ТаблицаКатегорий.ПорядокМеню КАК ПорядокМеню
		               |ПОМЕСТИТЬ КатегорииДовольствующихся
		               |ИЗ
		               |	&ТаблицаКатегорий КАК ТаблицаКатегорий
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	КатегорииДовольствующихся.КатегорияДовольствующихся КАК КатегорияДовольствующихся,
		               |	КатегорииДовольствующихсяПриемыПищи.ПриемПищи КАК ПриемПищи,
		               |	КатегорииДовольствующихся.ВариантМеню КАК ВариантМеню,
		               |	КатегорииДовольствующихся.Количество КАК Количество,
		               |	КатегорииДовольствующихсяПриемыПищи.НомерСтроки КАК НомерСтроки,
		               |	КатегорииДовольствующихся.ПорядокМеню КАК ПорядокМеню
		               |ПОМЕСТИТЬ ПриемыПищи
		               |ИЗ
		               |	КатегорииДовольствующихся КАК КатегорииДовольствующихся
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииДовольствующихся.ПриемыПищи КАК КатегорииДовольствующихсяПриемыПищи
		               |		ПО КатегорииДовольствующихся.КатегорияДовольствующихся = КатегорииДовольствующихсяПриемыПищи.Ссылка
		               |			И (КатегорииДовольствующихсяПриемыПищи.Используется)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПриемыПищи.КатегорияДовольствующихся КАК КатегорияДовольствующихся,
		               |	ПриемыПищи.ПриемПищи КАК ПриемПищи,
		               |	ПриемыПищи.ВариантМеню КАК ВариантМеню,
		               |	ТиповыеМеню.Блюдо КАК Блюдо,
		               |	ТиповыеМеню.Спецификация КАК Спецификация,
		               |	ПриемыПищи.Количество КАК Количество,
		               |	ПриемыПищи.ПриемПищи.Код КАК ПриемПищиКод,
		               |	ТиповыеМеню.Блюдо.Код КАК БлюдоКод,
		               |	ТиповыеМеню.Спецификация.Код КАК СпецификацияКод,
		               |	ПриемыПищи.КатегорияДовольствующихся.Код + ""_"" + ПриемыПищи.ВариантМеню.Код КАК КлючОтбора,
		               |	ТиповыеМеню.Выход КАК Выход,
		               |	ТиповыеМеню.ХронологическийПорядок КАК ПорядокБлюд,
		               |	ПриемыПищи.ПриемПищи.ХронологическийПорядок КАК ПорядокПриемПищи
		               |ИЗ
		               |	ПриемыПищи КАК ПриемыПищи
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТиповыеМеню КАК ТиповыеМеню
		               |		ПО ПриемыПищи.ПриемПищи = ТиповыеМеню.ПриемПищи
		               |			И ПриемыПищи.ВариантМеню = ТиповыеМеню.ВариантМеню
		               |			И ПриемыПищи.ПорядокМеню = ТиповыеМеню.Порядок
		               |ГДЕ
		               |	НЕ ЕСТЬNULL(ТиповыеМеню.Блюдо, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ПорядокПриемПищи,
		               |	ПорядокБлюд,
		               |	ПриемыПищи.НомерСтроки";
		Запрос.УстановитьПараметр("ТаблицаКатегорий",	ТаблицаКатегорий);
		Запрос.УстановитьПараметр("Организация",		Организация);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если СтруктураТЧ.Свойство("ТекущаяКатегория") Тогда
			
			СтрТекущейКатегории = МенюРаскладка.НайтиСтроки(Новый Структура("КатегорияДовольствующихся", ТекущаяКатегория.КатегорияДовольствующихся));
			
			Для каждого ТекСтрТекущейКатегории Из СтрТекущейКатегории Цикл
				МенюРаскладка.Удалить(ТекСтрТекущейКатегории);
			КонецЦикла;
			Для каждого СтрКатегории Из РезультатЗапроса Цикл
				ЗаполнитьЗначенияСвойств(МенюРаскладка.Добавить(), СтрКатегории);
			КонецЦикла;
			
		Иначе
			МенюРаскладка.Загрузить(РезультатЗапроса);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураТЧ.Свойство("СоставБлюда") Тогда
			
		Если СтруктураТЧ.Свойство("ТекущееБлюдо", ТекущееБлюдо) Тогда
			ТаблицаБлюд = Новый ТаблицаЗначений;
			ТаблицаБлюд.Колонки.Добавить("КатегорияДовольствующихся", Новый ОписаниеТипов("СправочникСсылка.КатегорииДовольствующихся"));
			ТаблицаБлюд.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
			ТаблицаБлюд.Колонки.Добавить("ВариантМеню", Новый ОписаниеТипов("СправочникСсылка.ВариантыМеню"));
			ТаблицаБлюд.Колонки.Добавить("ПриемПищи", Новый ОписаниеТипов("СправочникСсылка.ПриемыПищи"));
			ТаблицаБлюд.Колонки.Добавить("Блюдо", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
			ТаблицаБлюд.Колонки.Добавить("Спецификация", Новый ОписаниеТипов("СправочникСсылка.СпецификацииНоменклатуры"));
			
			ЗаполнитьЗначенияСвойств(ТаблицаБлюд.Добавить(), ТекущееБлюдо);
		Иначе
			ТаблицаБлюд = МенюРаскладка.Выгрузить();
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МенюРаскладка.КатегорияДовольствующихся,
		|	МенюРаскладка.ПриемПищи,
		|	МенюРаскладка.Блюдо,
		|	МенюРаскладка.Спецификация,
		|	МенюРаскладка.ВариантМеню
		|ПОМЕСТИТЬ МенюРаскладка
		|ИЗ
		|	&МенюРаскладка КАК МенюРаскладка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МенюРаскладка.КатегорияДовольствующихся,
		|	МенюРаскладка.ПриемПищи,
		|	МенюРаскладка.Блюдо,
		|	МенюРаскладка.Спецификация,
		|	СпецификацииНоменклатурыСпецификация.Номенклатура,
		|	ВЫБОР
		|		КОГДА СпецификацииНоменклатурыСпецификация.Ссылка.Количество = 0
		|			ТОГДА 0
		|		ИНАЧЕ СпецификацииНоменклатурыСпецификация.Количество / СпецификацииНоменклатурыСпецификация.Ссылка.Количество
		|	КОНЕЦ КАК Количество,
		|	МенюРаскладка.ВариантМеню
		|ИЗ
		|	МенюРаскладка КАК МенюРаскладка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпецификацииНоменклатуры.Спецификация КАК СпецификацииНоменклатурыСпецификация
		|		ПО МенюРаскладка.Спецификация = СпецификацииНоменклатурыСпецификация.Ссылка
		|ГДЕ
		|	НЕ ЕСТЬNULL(СпецификацииНоменклатурыСпецификация.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
		
		Запрос.УстановитьПараметр("МенюРаскладка", ТаблицаБлюд);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если СтруктураТЧ.Свойство("ТекущееБлюдо") Тогда
			
			СтрТекущееБлюдо = СоставБлюда.НайтиСтроки(ТекущееБлюдо);
			
			Для Каждого ТекСтрТекущееБлюдо Из СтрТекущееБлюдо Цикл
				СоставБлюда.Удалить(ТекСтрТекущееБлюдо);
			КонецЦикла;
			Для Каждого СтрБлюда Из РезультатЗапроса Цикл
				ЗаполнитьЗначенияСвойств(СоставБлюда.Добавить(), СтрБлюда);
			КонецЦикла;
			
		Иначе
			СоставБлюда.Загрузить(РезультатЗапроса);
		КонецЕсли;
		
	КонецЕсли;
	
	Если СтруктураТЧ.Свойство("Материалы") Тогда
		Материалы.Очистить();
		Если СтруктураТЧ.Количество() = 1 Тогда
			// Заполняется только таблица Материалы
			УдалитьЛишниеПродуктыПоКатегориям();
		КонецЕсли;
		ТаблицаПродуктов = УправлениеМатериальнымиЗапасами.РаспределитьПоСчетам(ЭтотОбъект, Дата);
		УправлениеМатериальнымиЗапасами.ЗаполнитьДокСписанияПоРасчетнойТаблице(ЭтотОбъект, ТаблицаПродуктов);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

Процедура УдалитьЛишниеПродуктыПоКатегориям()

	Если ДополнительныеСвойства.Свойство("ЛишниеПродуктыУдалены") Тогда
		Возврат;
	КонецЕсли;
	
	МассивКатегорий = КатегорииДовольствующихся.ВыгрузитьКолонку("КатегорияДовольствующихся");
	УдалитьЛишниеКатегорииДовольствующихсяИзТаблицы(Материалы,     МассивКатегорий);
	УдалитьЛишниеКатегорииДовольствующихсяИзТаблицы(МенюРаскладка, МассивКатегорий);
	УдалитьНеиспользуемыеСоставы();
	
	ДополнительныеСвойства.Вставить("ЛишниеПродуктыУдалены");
	
КонецПроцедуры

Процедура УдалитьЛишниеКатегорииДовольствующихсяИзТаблицы(Таблица, ДопустимыеКатегорииДовольствующихся)

	КатегорииИзТаблицы = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(КатегорииИзТаблицы, Таблица.ВыгрузитьКолонку("КатегорияДовольствующихся"), Истина);
	Для Каждого Категория Из КатегорииИзТаблицы Цикл
		Если ДопустимыеКатегорииДовольствующихся.Найти(Категория) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОтборСтрок = Новый Структура("КатегорияДовольствующихся", Категория);
		ЛишниеСтроки = Таблица.НайтиСтроки(ОтборСтрок);
		Для каждого Строка Из ЛишниеСтроки Цикл
			Таблица.Удалить(Строка);
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

Процедура УдалитьНеиспользуемыеСоставы()
	ИспользуемыеБлюда = МенюРаскладка.Выгрузить(, "КатегорияДовольствующихся, ВариантМеню, ПриемПищи, Блюдо, Спецификация");
	ИспользуемыеБлюда.Индексы.Добавить("КатегорияДовольствующихся, ВариантМеню, ПриемПищи, Блюдо, Спецификация");
	Отбор = Новый Структура("КатегорияДовольствующихся, ВариантМеню, ПриемПищи, Блюдо, Спецификация");
	ЛишниеСтроки = Новый Массив;
	Для каждого Строка Из СоставБлюда Цикл
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		Если ИспользуемыеБлюда.НайтиСтроки(Отбор).Количество() = 0 Тогда
			ЛишниеСтроки.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	Для каждого Строка Из ЛишниеСтроки Цикл
		СоставБлюда.Удалить(Строка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
